sysbench/server3/read_only_run_128.log
sysbench 1.0.18 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 128 tps: 200.25 qps: 3296.12 (r/w/o: 2884.43/0.00/411.69) lat (ms,95%): 746.32 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 128 tps: 208.31 qps: 3334.34 (r/w/o: 2917.02/0.00/417.32) lat (ms,95%): 719.92 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 128 tps: 206.60 qps: 3317.57 (r/w/o: 2904.47/0.00/413.10) lat (ms,95%): 719.92 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 200.80 qps: 3200.86 (r/w/o: 2799.36/0.00/401.49) lat (ms,95%): 846.57 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 128 tps: 205.40 qps: 3280.05 (r/w/o: 2869.65/0.00/410.41) lat (ms,95%): 746.32 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 205.50 qps: 3304.13 (r/w/o: 2892.93/0.00/411.20) lat (ms,95%): 719.92 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 128 tps: 206.60 qps: 3296.69 (r/w/o: 2883.29/0.00/413.40) lat (ms,95%): 733.00 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 128 tps: 205.40 qps: 3286.22 (r/w/o: 2875.63/0.00/410.59) lat (ms,95%): 733.00 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 128 tps: 204.20 qps: 3264.60 (r/w/o: 2856.00/0.00/408.60) lat (ms,95%): 746.32 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 128 tps: 210.91 qps: 3377.72 (r/w/o: 2955.91/0.00/421.82) lat (ms,95%): 719.92 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 128 tps: 208.00 qps: 3329.64 (r/w/o: 2913.85/0.00/415.79) lat (ms,95%): 733.00 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 128 tps: 212.00 qps: 3394.84 (r/w/o: 2970.34/0.00/424.51) lat (ms,95%): 707.07 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 128 tps: 211.40 qps: 3373.35 (r/w/o: 2950.36/0.00/422.99) lat (ms,95%): 707.07 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 128 tps: 209.00 qps: 3339.33 (r/w/o: 2921.72/0.00/417.60) lat (ms,95%): 733.00 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 128 tps: 207.70 qps: 3332.41 (r/w/o: 2917.71/0.00/414.70) lat (ms,95%): 719.92 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 128 tps: 211.80 qps: 3377.13 (r/w/o: 2952.83/0.00/424.30) lat (ms,95%): 707.07 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 128 tps: 184.89 qps: 2978.21 (r/w/o: 2608.14/0.00/370.08) lat (ms,95%): 877.61 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 128 tps: 184.71 qps: 2959.09 (r/w/o: 2589.68/0.00/369.41) lat (ms,95%): 977.74 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 128 tps: 184.00 qps: 2923.86 (r/w/o: 2556.76/0.00/367.09) lat (ms,95%): 831.46 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 128 tps: 174.40 qps: 2781.14 (r/w/o: 2432.63/0.00/348.50) lat (ms,95%): 877.61 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 128 tps: 188.40 qps: 3038.02 (r/w/o: 2660.02/0.00/378.00) lat (ms,95%): 787.74 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 128 tps: 193.60 qps: 3082.63 (r/w/o: 2696.14/0.00/386.49) lat (ms,95%): 759.88 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 128 tps: 170.70 qps: 2735.93 (r/w/o: 2394.33/0.00/341.60) lat (ms,95%): 909.80 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 128 tps: 178.10 qps: 2855.92 (r/w/o: 2499.21/0.00/356.70) lat (ms,95%): 846.57 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 128 tps: 180.70 qps: 2895.13 (r/w/o: 2533.74/0.00/361.39) lat (ms,95%): 816.63 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 128 tps: 168.40 qps: 2701.40 (r/w/o: 2364.70/0.00/336.70) lat (ms,95%): 909.80 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 128 tps: 191.90 qps: 3063.66 (r/w/o: 2679.75/0.00/383.91) lat (ms,95%): 831.46 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 128 tps: 179.90 qps: 2877.93 (r/w/o: 2518.44/0.00/359.49) lat (ms,95%): 831.46 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 128 tps: 190.30 qps: 3036.07 (r/w/o: 2655.66/0.00/380.41) lat (ms,95%): 802.05 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 128 tps: 180.80 qps: 2904.88 (r/w/o: 2543.07/0.00/361.81) lat (ms,95%): 893.56 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            822850
        write:                           0
        other:                           117550
        total:                           940400
    transactions:                        58775  (195.60 per sec.)
    queries:                             940400 (3129.67 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.4769s
    total number of events:              58775

Latency (ms):
         min:                                  287.28
         avg:                                  653.88
         max:                                 1252.72
         95th percentile:                      816.63
         sum:                             38431992.07

Threads fairness:
    events (avg/stddev):           459.1797/2.70
    execution time (avg/stddev):   300.2499/0.14