sysbench/server3/read_only_run_16.log
sysbench 1.0.18 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 162.95 qps: 2619.87 (r/w/o: 2292.46/0.00/327.41) lat (ms,95%): 144.97 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 157.60 qps: 2522.98 (r/w/o: 2207.67/0.00/315.31) lat (ms,95%): 130.13 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 173.20 qps: 2769.46 (r/w/o: 2423.17/0.00/346.30) lat (ms,95%): 112.67 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 184.20 qps: 2949.43 (r/w/o: 2581.02/0.00/368.40) lat (ms,95%): 104.84 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 185.30 qps: 2964.73 (r/w/o: 2594.03/0.00/370.69) lat (ms,95%): 104.84 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 179.80 qps: 2875.87 (r/w/o: 2516.26/0.00/359.61) lat (ms,95%): 106.75 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 169.80 qps: 2719.55 (r/w/o: 2379.96/0.00/339.59) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 166.70 qps: 2660.94 (r/w/o: 2327.73/0.00/333.20) lat (ms,95%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 167.10 qps: 2675.41 (r/w/o: 2341.11/0.00/334.30) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 162.40 qps: 2600.65 (r/w/o: 2275.86/0.00/324.79) lat (ms,95%): 123.28 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 152.90 qps: 2441.34 (r/w/o: 2135.74/0.00/305.61) lat (ms,95%): 130.13 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 153.10 qps: 2457.17 (r/w/o: 2150.77/0.00/306.40) lat (ms,95%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 16 tps: 170.80 qps: 2730.79 (r/w/o: 2389.29/0.00/341.50) lat (ms,95%): 116.80 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 16 tps: 158.30 qps: 2530.81 (r/w/o: 2214.31/0.00/316.50) lat (ms,95%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 16 tps: 162.20 qps: 2593.73 (r/w/o: 2269.24/0.00/324.49) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 16 tps: 156.40 qps: 2504.86 (r/w/o: 2191.86/0.00/313.01) lat (ms,95%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 16 tps: 172.60 qps: 2761.29 (r/w/o: 2416.19/0.00/345.10) lat (ms,95%): 114.72 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 16 tps: 186.50 qps: 2984.65 (r/w/o: 2611.54/0.00/373.11) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 16 tps: 189.10 qps: 3025.62 (r/w/o: 2647.52/0.00/378.10) lat (ms,95%): 99.33 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 16 tps: 191.10 qps: 3054.52 (r/w/o: 2672.52/0.00/382.00) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 16 tps: 184.60 qps: 2954.27 (r/w/o: 2584.98/0.00/369.30) lat (ms,95%): 104.84 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 16 tps: 195.10 qps: 3123.04 (r/w/o: 2732.64/0.00/390.41) lat (ms,95%): 94.10 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 16 tps: 189.70 qps: 3034.91 (r/w/o: 2655.51/0.00/379.40) lat (ms,95%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 16 tps: 193.80 qps: 3098.98 (r/w/o: 2711.78/0.00/387.20) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 16 tps: 187.70 qps: 3003.80 (r/w/o: 2628.00/0.00/375.80) lat (ms,95%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 16 tps: 192.90 qps: 3086.56 (r/w/o: 2700.86/0.00/385.69) lat (ms,95%): 95.81 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 16 tps: 189.09 qps: 3025.42 (r/w/o: 2647.53/0.00/377.89) lat (ms,95%): 99.33 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 16 tps: 190.81 qps: 3054.33 (r/w/o: 2672.61/0.00/381.72) lat (ms,95%): 99.33 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 16 tps: 192.60 qps: 3084.20 (r/w/o: 2698.70/0.00/385.50) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 16 tps: 184.49 qps: 2949.31 (r/w/o: 2580.32/0.00/368.99) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            742630
        write:                           0
        other:                           106090
        total:                           848720
    transactions:                        53045  (176.78 per sec.)
    queries:                             848720 (2828.44 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0641s
    total number of events:              53045

Latency (ms):
         min:                                   40.91
         avg:                                   90.50
         max:                                  262.94
         95th percentile:                      116.80
         sum:                              4800387.49

Threads fairness:
    events (avg/stddev):           3315.3125/7.83
    execution time (avg/stddev):   300.0242/0.02