sysbench/server3/read_only_run_64.log
sysbench 1.0.18 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 64 tps: 197.85 qps: 3214.73 (r/w/o: 2812.84/0.00/401.89) lat (ms,95%): 411.96 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 64 tps: 205.91 qps: 3286.96 (r/w/o: 2876.14/0.00/410.82) lat (ms,95%): 397.39 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 64 tps: 208.80 qps: 3345.45 (r/w/o: 2927.65/0.00/417.79) lat (ms,95%): 369.77 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 206.10 qps: 3299.42 (r/w/o: 2887.11/0.00/412.30) lat (ms,95%): 369.77 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 64 tps: 207.80 qps: 3319.26 (r/w/o: 2903.05/0.00/416.21) lat (ms,95%): 363.18 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 207.40 qps: 3329.46 (r/w/o: 2914.66/0.00/414.79) lat (ms,95%): 363.18 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 64 tps: 207.90 qps: 3323.78 (r/w/o: 2908.08/0.00/415.70) lat (ms,95%): 363.18 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 64 tps: 196.30 qps: 3130.08 (r/w/o: 2737.58/0.00/392.50) lat (ms,95%): 411.96 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 64 tps: 205.80 qps: 3308.75 (r/w/o: 2896.84/0.00/411.91) lat (ms,95%): 363.18 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 64 tps: 207.90 qps: 3320.86 (r/w/o: 2905.56/0.00/415.29) lat (ms,95%): 363.18 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 64 tps: 205.10 qps: 3278.32 (r/w/o: 2868.13/0.00/410.19) lat (ms,95%): 369.77 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 64 tps: 194.11 qps: 3104.80 (r/w/o: 2715.89/0.00/388.91) lat (ms,95%): 475.79 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 64 tps: 207.00 qps: 3303.16 (r/w/o: 2890.17/0.00/413.00) lat (ms,95%): 363.18 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 64 tps: 204.80 qps: 3284.26 (r/w/o: 2874.95/0.00/409.31) lat (ms,95%): 369.77 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 64 tps: 204.70 qps: 3277.61 (r/w/o: 2867.01/0.00/410.60) lat (ms,95%): 376.49 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 64 tps: 205.90 qps: 3293.19 (r/w/o: 2882.19/0.00/411.00) lat (ms,95%): 363.18 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 64 tps: 206.80 qps: 3310.87 (r/w/o: 2897.07/0.00/413.80) lat (ms,95%): 363.18 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 64 tps: 199.20 qps: 3181.08 (r/w/o: 2782.89/0.00/398.20) lat (ms,95%): 411.96 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 64 tps: 204.50 qps: 3278.21 (r/w/o: 2869.21/0.00/409.00) lat (ms,95%): 363.18 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 64 tps: 205.60 qps: 3289.05 (r/w/o: 2877.14/0.00/411.91) lat (ms,95%): 369.77 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 64 tps: 203.00 qps: 3249.09 (r/w/o: 2843.19/0.00/405.90) lat (ms,95%): 383.33 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 64 tps: 205.90 qps: 3289.28 (r/w/o: 2877.88/0.00/411.40) lat (ms,95%): 363.18 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 64 tps: 208.60 qps: 3348.33 (r/w/o: 2930.83/0.00/417.50) lat (ms,95%): 356.70 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 64 tps: 207.40 qps: 3315.78 (r/w/o: 2901.28/0.00/414.50) lat (ms,95%): 363.18 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 64 tps: 208.70 qps: 3330.21 (r/w/o: 2913.51/0.00/416.70) lat (ms,95%): 369.77 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 64 tps: 210.00 qps: 3364.60 (r/w/o: 2943.80/0.00/420.80) lat (ms,95%): 356.70 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 64 tps: 183.49 qps: 2922.80 (r/w/o: 2556.11/0.00/366.69) lat (ms,95%): 450.77 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 64 tps: 194.10 qps: 3127.47 (r/w/o: 2738.46/0.00/389.01) lat (ms,95%): 404.61 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 64 tps: 152.98 qps: 2434.66 (r/w/o: 2128.89/0.00/305.77) lat (ms,95%): 502.20 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 64 tps: 166.02 qps: 2665.25 (r/w/o: 2333.02/0.00/332.23) lat (ms,95%): 484.44 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            845054
        write:                           0
        other:                           120722
        total:                           965776
    transactions:                        60361  (201.05 per sec.)
    queries:                             965776 (3216.81 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.2250s
    total number of events:              60361

Latency (ms):
         min:                                  148.17
         avg:                                  318.22
         max:                                  617.81
         95th percentile:                      404.61
         sum:                             19208223.30

Threads fairness:
    events (avg/stddev):           943.1406/2.58
    execution time (avg/stddev):   300.1285/0.07